#设置客户端连接服务器编码
SET NAMES UTF8;
#丢弃数据库，如果存在
DROP DATABASE IF EXISTS vsb;
#创建数据库vsb,设置存储的编码
CREATE DATABASE vsb CHARSET=UTF8;
#进入该数据库
USE vsb;


#创建用户表
CREATE TABLE vsb_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,  #用户id
  uname VARCHAR(16) UNIQUE NOT NULL,   #用户名
  upwd VARCHAR(16) NOT NULL,           #用户密码                        
  phone CHAR(11) UNIQUE,               #手机号
  sex BOOL,                            #男-1 女-0
  avatar VARCHAR(128)                  #用户头像路径
);
/*
  user_name VARCHAR(16),               #用户真实姓名
  user_id CHAR(24),                    #身份证号
  birthday DATETIME                    #生日
  email VARCHAR(32),                   #邮箱
*/
#插入数据
INSERT INTO vsb_user VALUES
(NULL,'dingding','123456',18790687256,0,'./public/img/avatar/about1.png'),
(NULL,'tom','123456',18790687257,1,'./public/img/avatar/about2.png'),
(NULL,'lucy','123456',18790687258,0,'./public/img/avatar/about3.png'),
(NULL,'jeck','123456',18790687259,1,'./public/img/avatar/about4.png');

#创建小说类别表
CREATE TABLE vsb_title(
  tid INT PRIMARY KEY AUTO_INCREMENT,  #商品类别名id
  tname VARCHAR(12) UNIQUE             #商品标名
  -- titleid INT                          #类别id
);
#插入数据
INSERT INTO vsb_title VALUES
(10,'玄幻奇幻'),
(20,'武侠修真'),
(30,'历史军事'),
(40,'都市娱乐'),
(50,'同人休闲'),
(60,'科幻游戏'),
(70,'悬疑灵异'),
(80,'二次元');

#创建小说类名表
CREATE TABLE vsb_novel(
  nid INT PRIMARY KEY AUTO_INCREMENT,    #小说类名id
  nname CHAR(4),                         #小说类名  
  novelid INT,                
  FOREIGN KEY(novelid) REFERENCES vsb_title(tid)
);
#插入数据
INSERT INTO vsb_novel VALUES
(NULL,'王朝争霸',10),
(NULL,'东方玄幻',10),
(NULL,'异世大陆',10),
(NULL,'上古神话',10),
(NULL,'西方奇幻',10),

(NULL,'现代修真',20),
(NULL,'新派武侠',20),
(NULL,'传统武侠',20),
(NULL,'古典仙侠',20),
(NULL,'奇幻修真',20),

(NULL,'历史传记',30),
(NULL,'穿越历史',30),
(NULL,'架空历史',30),
(NULL,'世界军事',30),
(NULL,'乱世军阀',30),

(NULL,'都市异能',40),
(NULL,'都市生活',40),
(NULL,'青春校园',40),
(NULL,'职场商战',40),
(NULL,'都市重生',40),

(NULL,'电子竞技',50),
(NULL,'体育竞技',50),
(NULL,'动漫同人',50),
(NULL,'游戏同人',50),
(NULL,'小说同人',50),

(NULL,'科技时代',60),
(NULL,'末世危机',60),
(NULL,'星际争霸',60),
(NULL,'游戏设定',60),
(NULL,'游戏小说',60),

(NULL,'推理悬念',70),
(NULL,'恐怖惊悚',70),
(NULL,'灵异神怪',70),
(NULL,'神秘文化',70),
(NULL,'探险异闻',70),

(NULL,'变身入替',80),
(NULL,'动漫衍生',80),
(NULL,'奇妙物语',80),
(NULL,'原生幻想',80),
(NULL,'青春日常',80);

#创建小说详情表
CREATE TABLE vsb_details(
  did INT PRIMARY KEY AUTO_INCREMENT,      #小说id
  dtitle VARCHAR(12),                      #小说标题
  dimage VARCHAR(128),                     #小说图片路径
  author VARCHAR(8),                       #小说作者
  briefly VARCHAR(400)                     #小说简介
);
  /*chapter VARCHAR(24),                     #小说章节名
    content VARCHAR(4000)                    #小说内容 字数*/
#插入数据
INSERT INTO vsb_details VALUES
(NULL,'神道丹尊','./public/img/details/101.jpg','孤单地飞','绝世强者、一代丹帝凌寒为追求成神之路而殒落，万年后携不灭天经重生于同名少年，从此风云涌动，与当世无数天才争锋，重启传奇之路，万古诸天我最强！'),
(NULL,'非凡神主','./public/img/details/102.jpg','浪子边城','逆天命，夺造化！少年惊天而出，天下谁与争锋！'),

(NULL,'永恒国度','./public/img/details/201.jpg','孤独漂流','2019年9月23日凌晨，天灾降临。天道生变，万灵欲念执念充斥天地，天道不能承受，恶念横行，众生意念演变幻想世界，恶念，善念，执念，欲望纠缠不休，天道无法承受，已到极限，极则变，幻想降临，万界相融，万物霜天竞自由。此为新纪元开启，是毁灭，亦为新生。这一纪元为永恒纪元。'),
(NULL,'万界仙帝','./public/img/details/202.jpg','山上梧桐','一品天脉，全能修者，丹皇器王？我虐你如蚍蜉。众人所言大帝最强，于我来说帝如蝼蚁我便是万界之帝，万帝之王，我言即为秩序，我行即为天道！我，公子和！'),

(NULL,'大明之五好青年','./public/img/details/301.jpg','木允锋','混在大明朝最后的盛世里，做一个有活力的社团大佬。'),
(NULL,'龙魂特种兵','./public/img/details/302.jpg','东方小少','兵王归来，美女入怀。带着仇恨，带着使命，八年后踏入都市，搅动风云，龙战天下，铸就热血传奇！'),

(NULL,'我的冷傲女上司','./public/img/details/401.jpg','一马当先','娇媚萝莉，冷艳总裁，什么，火辣御姐？ 天呀，这些好像都会跟我没关系了。 当陆辰辰面对那张堪称耻辱的契约时，他才发现上了自己上司，究竟是个多大的错。 耻辱！！ 简直是耻辱啊！'),
(NULL,'特种医王在都市','./public/img/details/402.jpg','竣麟','自信人生一百年，自当纵横九万里。他，医可封圣，悬壶济世救万人；他，杀人如魔，伏尸遍地血浸衫；说到底，不过是一介凡人。“我是一个失败的人，从小被父母抛弃，长大被养父嫌弃，潦倒一身，子然一人，就这样平静的走吧。”黑夜里，周围一片死寂，在手指尖一道烟火和香岸上三点火星的映衬下，一个灵位若隐若现，秦绝轻轻将杯中酒洒在地上，祭奠自己'),

(NULL,'塔防世界','./public/img/details/501.jpg','烟云霞','邪恶力量席卷世界，所有的城市乡村被隔绝成一座座孤立的堡垒，坚强抵御着无穷无尽的魔物攻击。运输飞艇是这个世界唯一的交通工具。——欢迎来到世界级网游《塔防世界》！箭塔，城墙，魔法与蒸汽飞艇的热血世界！……王力是一名普通的外卖员，受一位严厉父亲的委托进入了《塔防世界》，王力的任务就是治疗他儿子的网瘾'),
(NULL,'网游之天谴修罗','./public/img/details/502.jpg','火星引力','为了拯救绝症妹妹的最后希望，凌尘进入新开启的虚拟游戏世界，并加入一个全是女孩子的小型工作室，从此踏上他的巅峰之路。一弯几乎被历史遗忘的上古邪物“天谴之月”成就了他不可超越的巅峰神话，也让他在不知不觉间踏上了一条注定遭天之谴罚的修罗之道。'),

(NULL,'我的房间有扇任意门','./public/img/details/601.jpg','五十块','一觉醒来，房间多了扇门！当卫子青推开这门的时候，竟然发现，可以随机出现在各种世界中，武侠，动漫，电视剧……更重要的是，竟然还可以将位面的人物给带回去现实……这一刻，卫子青的生活，变得有些不一样了起来，财富，美色，长生，已不再是遥不可及'),
(NULL,'美漫里的超神机械师','./public/img/details/602.jpg','量子蒙卡','超神机械师系统上身，穿越成漫威宇宙里佐拉博士的助手。拥有械力解析技能，可以学习漫威里的一切黑科技。冬兵的手臂？我造个更好的给你。钢铁侠的盔甲？我早10年就造出来了。章鱼博士的触手？关键技术突破我来提供。绿巨人变异？不好意思，当时我在场，也受到了辐射。至于紫薯光头佬，他能不能集齐无限宝石呢？'),

(NULL,'诡异在线中','./public/img/details/701.jpg','慢点说','【你使用道具“崂山派破煞符”对“血衣厉鬼”造成致死一击。】【你已击杀“血衣厉鬼”。】【恭喜升级，解锁权限：阴阳眼、谛听耳。】洛封站在灯光昏暗的走廊里，手提一柄斩尽魑魅魍魉的绣春刀，回头望着从房间里蜂拥而出的一群群厉鬼，嘴角一抽：“这就是所谓的新手级副本？！”……非系统文、非无限流，简介无能，一看便知。'),
(NULL,'夜路押镖','./public/img/details/702.jpg','老八零','你敢走夜路吗？你不会知道，在你熟睡的每一个深夜，都有一支镖队悄悄前行。'),

(NULL,'嫡女重生记','./public/img/details/801.jpg','六月浩雪','  在家是小透明，嫁人后是摆设，最后葬身火海尸骨无存，这是韩玉熙上辈子的写照。重活一世，韩玉熙努力上进，只愿不再做陪衬与花瓶，然后觅得如意郎君，平安富贵过一生。可惜事与愿违，嫁了个身负血海深仇的郎君，韩玉熙的人生开始翻天覆地，但她新的人生却是好事多磨，苦尽甘来。'),
(NULL,'别闹，薄先生！','./public/img/details/802.jpg','楠楠李','沈小姐忙着吃饭，睡觉，教渣渣如何做人！薄先生忙着撩沈小姐，撩沈小姐，还是撩沈小姐！“不都说薄执行长清心寡欲谦谦君子不近女色吗？”薄先生眯着眼睛靠在沙发上，动作清闲又优雅，“乖，叫老公。”薄太太扶额，看着那张禁欲的脸，忽然就想起了刚刚沙发上的风起云涌——那种明明冷冰冰却又对她欲罢不能的样');